#!/usr/bin/env python3

import WikiExtractor3

before = """
{{Карточка компании 
|название             = Киевстар<br />{{lang-uk|Київстар}}
|логотип = [[Файл:Kyivstar logo15.png|250px]]
|тип = [[Акционерное общество]]
|девиз = З думкою про Вас ({{lang-ru|Думая о Вас}})
|основана = [[1994]]
|расположение = {{Флагификация|Украина}}: [[Киев]]
|ключевые фигуры = Пётр Чернышов — <small>Президент компании</small>
| отрасль = {{ISIC|телеком|Украины}}
|продукция            = услуги сотовой связи, мобильного и стационарного Интернет-доступа
|оборот = 11,59 млрд грн. ([[2009]])
|операционная прибыль = 6,953 млрд грн ([[2011]])
|чистая прибыль = 3,685 млрд грн. ([[2009]])
|число сотрудников = 5053 (декабрь [[2009]])<ref>[http://proit.com.ua/news/telecom/2009/10/20/130152.html Количество сотрудников]</ref>
|сайт = [http://kyivstar.ua/ru/ Официальный сайт]
}}
«'''Киевстар'''» ({{lang-uk|Київстар}}) — [[Украина|украинский]] телекоммуникационный оператор, первый в стране по количеству пользователей, который предоставляет услуги [[мобильная связь|мобильной связи]] (в стандартах [[GSM]]-[[EDGE]] и [[UMTS]]-[[HSPA+]]) а также подключение к сети [[Интернет]] (на основе технологии [[FTTx|FTTB]]). .

== О компании ==

Основана в [[1994 год]]у. Предоставляет услуги мобильной связи с [[1997 год]]а. Президент компании — Петр Чернышов (до 25 июня 2014 — [[Литовченко, Игорь Владимирович|Игорь Литовченко]])

=== Номерная ёмкость ===

Оператор Киевстар имеет 5 [[Коды операторов мобильной связи Украины|сетевых кодов]] — 67, 68<ref>до 21 июня 2012 года код 68 (068) принадлежал ЧАО «Украинские радиосистемы»</ref>, 96, 97, 98 (до 14 октября 2009 года 067, 068, 096, 097, 098), а также номерные ёмкости в стационарной телефонной сети многих городов Украины. Телефонные номера в международном формате имеют вид +38067xxxxxxx, +38068xxxxxxx, +38096xxxxxxx, +38097xxxxxxx, +38098xxxxxxx.

== Акционеры ==
* [[VimpelCom Ltd.]] (100 %).

== История ==
"""

after = """
{{Нет ссылок|дата=13 мая 2011}}
[[1994]] —
* Основание компании «Bridge», позже получившей название «Киевстар».

[[1997]] —
* первый звонок в сети «Киевстар» (9 декабря 1997 года).

[[1998]] —
* открытие пяти представительств в самых крупных [[Города Украины|городах Украины]] — [[Одесса]], [[Днепропетровск]], [[Харьков]], [[Львов]], [[Запорожье]], ;
* впервые на украинском рынке введена услуга коротких текстовых сообщений [[SMS|СМС]]:
* внедрена услуга международного [[роуминг]]а.

[[1999]] —
* внедрена услуга предоплаченной связи «ACE&BASE»;
* впервые на рынке введена посекундная тарификация с 30-й секунды.
* Открытие представительства в АР Крым

[[2000]] —
* впервые на рынке введены бесплатные входящие звонки внутри сети для всех абонентов;
* сетью «Киевстар» охвачены все областные центры и основные пути национального и регионального значения;
* впервые на рынке введены услуги [[WAP]] и традиционного доступа к сети Интернет;
* компания становится первым оператором, в сети которого введена услуга [[GSM-банкинг]]а («СтарКард»);
* абонентам предоставляется возможность межстандартного роуминга.

[[2001]] —
* количество абонентов превысило отметку 1 000 000. «Киевстар» становится лидером по количеству абонентов на мобильном рынке [[Украина|Украины]].

[[2002]] —
* введена в тестовую эксплуатацию технология высокоскоростной передачи данных [[GPRS]];
* «Киевстар» становится первым мобильным оператором Украины, предоставляющим услуги роуминга во всех европейских странах.

[[2004]] —
* «Киевстар» вторым на Украине (после мобильного оператора [[Life:) (Украина)|life:)]])продемонстрировал [[EDGE]] — принципиально новую технологию высокоскоростной передачи данных;
* впервые на рынке временно (в течение 3-х месяцев) введены полностью бесплатные разговоры между абонентами DJUICE.

[[2005]] —
* в августе количество абонентов превысило отметку 10 000 000.

[[2006]] —
* в конце года количество абонентов превысило отметку 20 000 000.

[[2007]] —
* в марте совместно с украинским порталом работы была запущена wap-версия [[rabota.ua]];
* В мае запущен новый тарифный план эконом-класса «Мобилыч» (закрыт через 2 года, абоненты переведены на тарифные планы «Киевстар»);
* международное рейтинговое агентство Moody’s Investors Service повышает кредитный рейтинг «Киевстар» с В1 до Ва3.

[[2008]] —
* впервые начато предоставление услуг связи 3G совместно с оператором Utel (Укртелеком) в двух стандартах: WCDMA, HSDPA<ref>[http://kyivstar.in/?p=67 3G от Киевстар | KYIVSTAR.in<!-- Заголовок добавлен ботом -->]</ref> в режиме [[роуминг]]а.

[[2009]] —
* в апреле прекращена продажа стартовых пакетов под суббрендом «Мобилыч»;
* запущен музыкальный портал DJUICE MUSIC DRIVE, социальная сеть для молодых музыкантов;
* [[5 октября]] 2009 объявлено, что Altimo и Telenor подписали соглашение об объединении «Вымпелкома» и «Киевстара» в новую компанию — VimpelCom Ltd. 43,9 % голосующих акций в ней получит «Альфа-групп», 35,42 % — Telenor, ещё 20,69 % будут торговаться на NYSE<ref>{{cite web|author=Анна Балашова, Анастасия Горшкова.|date=6 октября 2009|url=http://www.kommersant.ru/doc.aspx?DocsID=1250894|title=Провоевавшиеся|publisher=Коммерсантъ № 185 (4240)|accessdate=2010-08-13|archiveurl=http://www.webcitation.org/61CMBTSFr|archivedate=2011-08-25}}</ref>.

[[2010]] —
* с марта «Киевстар» предоставляет услуги высокоскоростного фиксированного интернет-доступа в семи крупнейших городах Украины — [[Киев]], [[Донецк]], [[Днепропетровск]], [[Харьков]], [[Львов]], [[Симферополь]], [[Одесса]].

[[2012]] —
* «Киевстар» предоставляет доступ к широкополосному интернету по технологии FTTB (услуга «Домашний Интернет») в 135 городах Украины, став крупнейшим оператором на рынке высокоскоростного фиксированного интернет-доступа (FTTB) для населения<ref>[http://www.kyivstar.ua/ru/dp/press_center_new/reporters/releases/?id=24804 Прес-релиз компании Киевстар]</ref>
* «Киевстар» стал крупнейшим коммерческим оператором на рынке высокоскоростного фиксированного интернет-доступа для населения<ref>[http://www.iks-consulting.ru/news/4477485.html Отчет iKS-Consulting о украинском рынке ШПД от 29.08.2012]</ref>
[[2014]] —
* 13 июня 2014 года компанией было анонсировано назначение на должность Президента «Киевстар» Петра Чернышова (до прихода в «Киевстар» Петр Чернышов на протяжении нескольких лет работал генеральным директором Carlsberg Ukraine, позднее — вице-президентом, ответственным за работу Carlsberg Group в 6 странах Восточной Европы).
* 25 июня 2014 года Президентом «Киевстар» официально стал Пётр Чернышов.

[[2015]] —
* [[23 февраля]] [[2015|2015 года]] — Киевстар получил лицензию на радиочастоты 3G по технологии [[UMTS|UMTS-2100]]. По условиям лицензии, операторы должны в течение 18 месяцев охватить 3G-связью все областные центры.  
* 3 марта 2015 года — Киевстар провел первое публичное тестирование 3G-интернета при участии украинских журналистов. Технические специалисты оператора добились скорости в 3G-сети 35-37 Мбит/сек на загрузку данных.
* 14 мая 2015 года — компания Киевстар провела второе некоммерческое тестирования 3G сети в Киеве<ref>{{cite news|url=http://finance.bigmir.net/news/companies/56639-Kievstar-nachal-testirovat--3G-v-Kieve--na-ocheredi---L-vov|title=«Киевстар начал тестировать 3G в Киеве»|date= 14.06.2015|publisher=,ООО "ДИДЖИТАЛ ВЕНЧЕЗ"|accessdate=2015-11-11}}</ref>.

== Статистика ==

«Киевстар» обслуживает около 27 млн абонентов (по состоянию на 1 марта 2013)<ref>[http://itexpert.org.ua/rubrikator/item/24657-kolichestvo-polzovatelej-mobilnoj-svyazi-v-ukraine-dostiglo-5863-mln.html Количество пользователей мобильной связи в Украине достигло 58,63 млн — IT Expert] {{недоступная ссылка|http://itexpert.org.ua/rubrikator/item/24657-kolichestvo-polzovatelej-mobilnoj-svyazi-v-ukraine-dostiglo-5863-mln.html}}</ref>. Сеть «Киевстар» охватывает все крупные и малые города и более 28 тыс. сельских населенных пунктов, все основные национальные и региональные трассы, большинство морских и речных побережий Украины, обеспечивая покрытие территории, где проживает 98 % [[Население Украины|населения Украины]]. «Киевстар» предоставляет услуги [[EDGE]]/[[GPRS]] на всей территории своего покрытия Украины. [[Роуминг]]овые услуги компания «Киевстар» предоставляет в сетях 326 зарубежных операторов в 195 [[страна]]х на 5 [[континент]]ах мира.
{{нет АИ 2|
К началу марта 2015 года количество уникальных мобильных 3G-устройств в сети Киевстар составило 7,936 млн. Самые популярные из них — смартфоны на базе операционной системы Android (4,242 млн). Остальные 3G-гаджеты — это смартфоны на других ОС, планшеты, USB-модемы, PC-карты, ноутбуки с модулем 3G, 3G Wi-Fi роутеры, «умные» часы и другое.|9|04|2015}}

== Деятельность ==

Валовый доход в 2008 году (рассчитан по украинским стандартам бухгалтерского учёта) — 15,226 млрд грн. /1 долл — 7,7 грн./ (доход оператора в 2008 г вырос на 15,8 проц по сравнению с 2007). Чистая прибыль — 5,555 млрд грн. (рост на 38,1 % по сравнению с 2007 — 4,025 млрд грн.). Операционная прибыль — 6,525 млрд грн. (5,256 млрд грн. в 2007)<ref>http://bit.prime-tass.ru/news/show.asp?topicid=17&id=65216 Чистая прибыль украинского оператора мобильной связи «Киевстар» в 2008 г. выросла</ref>.

Валовый доход «Киевстар» в [[2009 год|2008 году]] — 11,59 млрд грн., операционная прибыль — 4,944 млрд грн., чистая прибыль — 3,685 млрд грн<ref>http://web.archive.org/web/20110104142805/http://www.kyivstar.ua/f/1/about/partners/KSG_2009_IFRS_FS_Rus.pdf</ref>. Доля «Киевстар» на украинском рынке мобильной связи в мая 2010 года составляет 40 %.

На протяжении 2009 года число пользователей мобильного интернета «Киевстар» выросло на 112 % до 1,6 млн, а доход от сервисов [[EDGE]]/[[GPRS]] и [[WAP]] составил свыше 160 млн грн. Доход от цифровой музыки в 2009 году составил более 100 млн грн. Количество пользователей рингбектонов увеличилось на 18 % до 4 млн.

По состоянию на декабрь 2009 года в компании «Киевстар» работает 5093 чел.

== Примечания ==
{{примечания}}

== Ссылки ==
{{внешние ссылки нежелательны}}
* {{official|kyivstar.ua}}
* {{twitter|TwiyKyivstar}}

{{Мобильная связь на Украине}}

[[Категория:Торговые марки Украины]]
[[Категория:Интернет-провайдеры Украины]]
[[Категория:Альфа-Групп]]
[[Категория:VimpelCom Ltd.]]
"""
import regex
lower_bound_section_regexes = [regex.compile(r'(^|\s)={' + str(i) + r',}(\s|$)') if i > 0 else None for i in range(7)]
upper_bound_section_regexes = [regex.compile(r'(^|\s)={1,' + str(i) + r'}(\s|$)') if i > 0 else None for i in range(7)]

def extract_wiki_section(before, after):
    r_before = ''.join(reversed(before))
    m = lower_bound_section_regexes[2].search(r_before)
    sep_len = 2
    if m is not None: 
        sep_len = len(m.group(0).strip())
        before = before[len(before) - m.start():]
    print(before, sep_len)

    m = upper_bound_section_regexes[sep_len].search(after)
    if m is not None:
        after = after[:m.start()]

    return '\n'.join([before, after])

print(extract_wiki_section(before, after))
